/**
 *  vue
 *      1> vue是什么? {1 什么是渐进式框架?}
 *      2> 为什么要学习vue? 
 *      3> vue 能带来什么方便 
 *  1> (vue 是什么?) {
 *      1.vue 是一套构建用户界面的渐进式框架   
 *          (1) . 什么是渐进式框架? {
 *              渐进式框架就是没有太多的依赖,主张最少,没有angular和react那么多主张,
 *      }   
 *  }
 *  2 > 为什么要学习vue ? {
 *      vue属于单页面应用,渐进式框架,主张最少, 
 *  }
 *  3> vue 能带来什么方便/? {
 *      1. vue的核心是虚拟DOM, 什么是虚拟DOM? {
 *          所谓虚拟DOM,就是伪DOM,他不是一个真实的DOM,而是通过JS模拟出来的具有真实DOM解构的一个树形结构
 *      } 
 *      2. 为什么要用js模拟DOM? {
 *          1> 前端三大语言(html, css, js) 只有js能进行判断, 递归, 实现各种逻辑,实现各种算法.
 *          2> 实现虚拟DOM 就要用到Diff算法 
 *      }
 *  }
 */